Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridlinesOutsideWillBeRedependent Property
 Type associated curtain grid lines outside of the edited wall boundaries will be made dependent again in order that they remain on the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlinesOutsideWillBeRedependent { get; }
Public Shared ReadOnly Property GridlinesOutsideWillBeRedependent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlinesOutsideWillBeRedependent {
	FailureDefinitionId^ get ();
}
static member GridlinesOutsideWillBeRedependent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace